// condition - nohtsol
// loop - davtalt

// 0 - false , 1 - true

// =, > , < , !
// ! эсрэг утгыг илэрхийлнэ
// = - Хувьсагчид утга оноох, хувьсагчийн утгыг өөрчлөх
// === - нөхцөл шалгах (өгөгдлийн төрлийг мөн шалгана)

// >= , <= - их (бага) буюу тэнцүү

var password = "MyPassword123";
var num = "123";

var too;

// if statement - нөхцөл шалгахад ашиглах reserved word

// if(password === "MyPassword12"){ // true
//     // нөхцлийн үр дүн true байгаа тохиолдолд энэ хэсэг ажиллана
//     console.log("Welcome")
// } else { // false
//     // нөхцлийн үр дүн false байгаа тохиолдолд энэ хэсэг ажиллана
//     console.log("Password is wrong!!!")
// }

// 0 , null , undefined - false;
// 1+, datatype , array, obj - true

// if(!too){
//     console.log('blalba')
// }


// if else statement

// Гараас нас оруулаад, нас нь 18-с их буюу тэнцүү бол консолд насанд
// хүрсэн гэж хэвлэ. 18 - с бага бол хүүхэд нэж хэвлэ

// 5 оронтой тоо оруулаад, тухайн тооны 1 болон 4 дэх цифрүүд 2лаа сондгой байвал
// тэдгээрийн нийлбэрийг 2 дахин үржүүлээд консолд хэвлэ. Сондгой биш бол зүгээр 
// нийлбэрийг хэвлэ


// 3ш тоо оруулаад, 10с бага хэдэн ширхэг тоо байгааг тоолж консолд хэвлэ


// 5 оронтой тоо оруулаад бүх цифрүүдийн нийлбэрийг ол

















